<h3>무작정 따라하기-8-2</h3>

In [2]:
import pandas as pd

data = pd.read_excel("K팀 대학 생활 만족도 설문(응답).xlsx")
data.head()

   id  Q1   Q2    Q3  Q4   Q5      Q6      Q7  Q8  Q9        Q10
0   1  남자  3학년   인사대   6  그렇다      보통     불만족  만족   3        학생회
1   2  여자  1학년  디자인대   6  그렇다      만족      만족  보통   3  아직은 모르겠다.
2   3  여자  1학년   과기대   6  그렇다      보통      보통  보통   4        모람제
3   4  여자  1학년   인사대   5   보통      만족  매우 불만족  보통   3     아직 없는듯
4   5  남자  1학년   과기대   6  그렇다  매우 불만족   매우 만족  만족   4    동아리,소모임

In [3]:
data['Q1'].value_counts()

Q1
여자    27
남자    14
Name: count, dtype: int64

In [4]:
pd.crosstab(data['Q1'], columns="빈도")

col_0  빈도
Q1
남자     14
여자     27

In [5]:
pd.crosstab(data['Q1'], columns='빈도', margins=True)

col_0  빈도  All
Q1
남자     14   14
여자     27   27
All    41   41

In [6]:
result = pd.crosstab(data['Q5'], columns='상대도수', 
                     normalize=True, margins=True)
result

col_0    상대도수    All
Q5
그렇다     0.675  0.675
그렇지 않다  0.025  0.025
매우 그렇다  0.125  0.125
보통      0.175  0.175
All     1.000  1.000

In [7]:
type(result)

pandas.core.frame.DataFrame

In [8]:
result.index

Index(['그렇다', '그렇지 않다', '매우 그렇다', '보통', 'All'], dtype='object', name='Q5')

In [9]:
result.values

array([[0.675, 0.675],
       [0.025, 0.025],
       [0.125, 0.125],
       [0.175, 0.175],
       [1.   , 1.   ]])

In [11]:
pd.crosstab(data.Q2, data.Q5)

Q5   그렇다  그렇지 않다  매우 그렇다  보통
Q2
1학년   21       0       5   6
2학년    2       1       0   0
3학년    4       0       0   1

In [12]:
pd.crosstab(data.Q2, data.Q5, margins=True)

Q5   그렇다  그렇지 않다  매우 그렇다  보통  All
Q2
1학년   21       0       5   6   32
2학년    2       1       0   0    3
3학년    4       0       0   1    5
All   27       1       5   7   40

In [13]:
pd.crosstab(data.Q2, data.Q5, margins=True, normalize=True)

Q5     그렇다  그렇지 않다  매우 그렇다     보통    All
Q2
1학년  0.525   0.000   0.125  0.150  0.800
2학년  0.050   0.025   0.000  0.000  0.075
3학년  0.100   0.000   0.000  0.025  0.125
All  0.675   0.025   0.125  0.175  1.000

In [14]:
tbl = pd.crosstab(data.Q2, data.Q5, margins=True, normalize=True)
round(tbl, 2)

Q5    그렇다  그렇지 않다  매우 그렇다    보통   All
Q2
1학년  0.52    0.00    0.12  0.15  0.80
2학년  0.05    0.02    0.00  0.00  0.08
3학년  0.10    0.00    0.00  0.02  0.12
All  0.68    0.02    0.12  0.18  1.00

In [15]:
air = pd.read_csv("서울시대기오염_2025-10(UTF-8).csv")
air.head()

       data point    pm   fpm    ozon
0  20251001   강남구  32.0  20.0  0.0310
1  20251001  강남대로  31.0  20.0  0.0233
2  20251001   강동구  37.0  23.0  0.0359
3  20251001  강변북로  37.0  21.0  0.0189
4  20251001   강북구  27.0  17.0  0.0380

In [17]:
air.tail()

          data point    pm   fpm    ozon
1545  20251031  한강대로  50.0  30.0  0.0192
1546  20251031    항동  38.0  26.0  0.0216
1547  20251031    행주  29.0  18.0  0.0251
1548  20251031   홍릉로  35.0  24.0  0.0196
1549  20251031   화랑로  36.0  22.0  0.0191

In [19]:
# 기술 통계량 (연속형 자료만)
air.describe()

               data           pm          fpm         ozon
count  1.550000e+03  1550.000000  1550.000000  1550.000000
mean   2.025102e+07    16.994839     8.299355     0.025322
std    8.947159e+00    10.801333     6.757111     0.007360
min    2.025100e+07     3.000000     0.000000     0.006000
25%    2.025101e+07     8.000000     3.000000     0.020400
50%    2.025102e+07    14.000000     6.000000     0.025200
75%    2.025102e+07    26.000000    12.000000     0.029700
max    2.025103e+07    50.000000    33.000000     0.079200

In [22]:
# data 변수 제외 
tbl = air.iloc[:, 1:].describe()
round(tbl, 2)

            pm      fpm     ozon
count  1550.00  1550.00  1550.00
mean     16.99     8.30     0.03
std      10.80     6.76     0.01
min       3.00     0.00     0.01
25%       8.00     3.00     0.02
50%      14.00     6.00     0.03
75%      26.00    12.00     0.03
max      50.00    33.00     0.08

In [24]:
data = air[['pm', 'fpm', 'ozon']]
data.head(2)

     pm   fpm    ozon
0  32.0  20.0  0.0310
1  31.0  20.0  0.0233

In [26]:
data.mean()

pm      16.994839
fpm      8.299355
ozon     0.025322
dtype: float64

In [29]:
data.median()

pm      14.0000
fpm      6.0000
ozon     0.0252
dtype: float64

In [31]:
data.max()

pm      50.0000
fpm     33.0000
ozon     0.0792
dtype: float64

In [33]:
# agg를 아용한 통계량 구하기 

data.agg(['mean'])

             pm       fpm      ozon
mean  16.994839  8.299355  0.025322

In [35]:
data.agg(['min', 'median', 'mean', 'max'])

               pm        fpm      ozon
min      3.000000   0.000000  0.006000
median  14.000000   6.000000  0.025200
mean    16.994839   8.299355  0.025322
max     50.000000  33.000000  0.079200

In [36]:
data[['pm', 'fpm']].agg(['min', 'mean', 'max'])

             pm        fpm
min    3.000000   0.000000
mean  16.994839   8.299355
max   50.000000  33.000000

In [ ]:
# 그룹별 통계량 구하기

In [37]:
data = pd.read_excel("한국도로교통공단_일자별 시군구별 교통사고 통계_20241231.xlsx")
data.head()

   발생월  발생일  시도   시군구  사고건수  사망자수  중상자수  경상자수  부상신고자수
0    1    1  서울    중구     4     0     2     5       0
1    1    1  서울   용산구     1     0     2     0       0
2    1    1  서울   성동구     1     0     0     1       0
3    1    1  서울  동대문구     1     0     0     1       0
4    1    1  서울   성북구     3     0     1     2       0

In [39]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 57676 entries, 0 to 57675
Data columns (total 9 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   발생월     57676 non-null  int64
 1   발생일     57676 non-null  int64
 2   시도      57676 non-null  object
 3   시군구     57676 non-null  object
 4   사고건수    57676 non-null  int64
 5   사망자수    57676 non-null  int64
 6   중상자수    57676 non-null  int64
 7   경상자수    57676 non-null  int64
 8   부상신고자수  57676 non-null  int64
dtypes: int64(7), object(2)
memory usage: 4.0+ MB

In [40]:
grp = data.groupby("시도")
grp.size()

시도
강원    2938
경기    9915
경남    3930
경북    4256
광주    1649
대구    2769
대전    1753
부산    4742
서울    8610
세종     346
울산    1519
인천    2622
전남    4019
전북    2406
제주     708
충남    3210
충북    2284
dtype: int64

In [41]:
df = data.iloc[:, [2,4,5,6,7,8]]
df.tail(2)

       시도  사고건수  사망자수  중상자수  경상자수  부상신고자수
57674  울산     6     0     3     3       0
57675  울산     1     0     2     0       0

In [42]:
grp = df.groupby('시도')
grp.sum()

     사고건수  사망자수   중상자수   경상자수  부상신고자수
시도
강원   5930   121   1900   6438     908
경기  52175   472  12235  57460    6712
경남  10703   233   4254   9309     994
경북  10403   264   3732  10200     869
광주   6908    41   1105   8686     492
대구  10222    89   2537  10517    1175
대전   7490    41   1556   8790     342
부산  11255   102   3418  10759     995
서울  33465   212   7575  33387    3365
세종   1231     7    233   1319     257
울산   3576    52   1144   3325     435
인천   8089    87   1720   8536     512
전남   8213   201   2257   9624     525
전북   5841   174   1784   6426     277
제주   3963    48   1048   4062     634
충남   8896   233   2857   9233     716
충북   7989   144   2198   9200     450

In [43]:
result = grp.mean()
round(result, 2)

    사고건수  사망자수  중상자수  경상자수  부상신고자수
시도
강원  2.02  0.04  0.65  2.19    0.31
경기  5.26  0.05  1.23  5.80    0.68
경남  2.72  0.06  1.08  2.37    0.25
경북  2.44  0.06  0.88  2.40    0.20
광주  4.19  0.02  0.67  5.27    0.30
대구  3.69  0.03  0.92  3.80    0.42
대전  4.27  0.02  0.89  5.01    0.20
부산  2.37  0.02  0.72  2.27    0.21
서울  3.89  0.02  0.88  3.88    0.39
세종  3.56  0.02  0.67  3.81    0.74
울산  2.35  0.03  0.75  2.19    0.29
인천  3.09  0.03  0.66  3.26    0.20
전남  2.04  0.05  0.56  2.39    0.13
전북  2.43  0.07  0.74  2.67    0.12
제주  5.60  0.07  1.48  5.74    0.90
충남  2.77  0.07  0.89  2.88    0.22
충북  3.50  0.06  0.96  4.03    0.20

In [44]:
result2 = result.sort_values(by='사고건수', ascending=False)
round(result2, 2)

    사고건수  사망자수  중상자수  경상자수  부상신고자수
시도
제주  5.60  0.07  1.48  5.74    0.90
경기  5.26  0.05  1.23  5.80    0.68
대전  4.27  0.02  0.89  5.01    0.20
광주  4.19  0.02  0.67  5.27    0.30
서울  3.89  0.02  0.88  3.88    0.39
대구  3.69  0.03  0.92  3.80    0.42
세종  3.56  0.02  0.67  3.81    0.74
충북  3.50  0.06  0.96  4.03    0.20
인천  3.09  0.03  0.66  3.26    0.20
충남  2.77  0.07  0.89  2.88    0.22
경남  2.72  0.06  1.08  2.37    0.25
경북  2.44  0.06  0.88  2.40    0.20
전북  2.43  0.07  0.74  2.67    0.12
부산  2.37  0.02  0.72  2.27    0.21
울산  2.35  0.03  0.75  2.19    0.29
전남  2.04  0.05  0.56  2.39    0.13
강원  2.02  0.04  0.65  2.19    0.31

In [45]:
result = grp[['사고건수', '경상자수']].agg(['min', 'mean', 'max'])
result

   사고건수               경상자수
    min      mean max  min      mean max
시도
강원    1  2.018380  12    0  2.191287  25
경기    1  5.262229  33    0  5.795260  41
경남    1  2.723410  20    0  2.368702  44
경북    1  2.444314  18    0  2.396617  21
광주    1  4.189206  15    0  5.267435  22
대구    1  3.691585  15    0  3.798122  28
대전    1  4.272675  17    0  5.014261  22
부산    1  2.373471  13    0  2.268874  15
서울    1  3.886760  23    0  3.877700  36
세종    1  3.557803  11    0  3.812139  16
울산    1  2.354180   9    0  2.188940  14
인천    1  3.085050  14    0  3.255530  21
전남    1  2.043543  12    0  2.394626  21
전북    1  2.427681  15    0  2.670823  23
제주    1  5.597458  18    0  5.737288  25
충남    1  2.771340  21    0  2.876324  34
충북    1  3.497811  25    0  4.028021  42

In [46]:
result.info()

<class 'pandas.core.frame.DataFrame'>
Index: 17 entries, 강원 to 충북
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   (사고건수, min)   17 non-null     int64
 1   (사고건수, mean)  17 non-null     float64
 2   (사고건수, max)   17 non-null     int64
 3   (경상자수, min)   17 non-null     int64
 4   (경상자수, mean)  17 non-null     float64
 5   (경상자수, max)   17 non-null     int64
dtypes: float64(2), int64(4)
memory usage: 952.0+ bytes

In [48]:
result.iloc[:,1] = result.iloc[:,1].round(2)
result.iloc[:,4] = result.iloc[:,4].round(2)
result

   사고건수           경상자수
    min  mean max  min  mean max
시도
강원    1  2.02  12    0  2.19  25
경기    1  5.26  33    0  5.80  41
경남    1  2.72  20    0  2.37  44
경북    1  2.44  18    0  2.40  21
광주    1  4.19  15    0  5.27  22
대구    1  3.69  15    0  3.80  28
대전    1  4.27  17    0  5.01  22
부산    1  2.37  13    0  2.27  15
서울    1  3.89  23    0  3.88  36
세종    1  3.56  11    0  3.81  16
울산    1  2.35   9    0  2.19  14
인천    1  3.09  14    0  3.26  21
전남    1  2.04  12    0  2.39  21
전북    1  2.43  15    0  2.67  23
제주    1  5.60  18    0  5.74  25
충남    1  2.77  21    0  2.88  34
충북    1  3.50  25    0  4.03  42

In [50]:
# 서울 5개구만 추출

gu_name = ['강동구', '강서구', '강남구', '강북구', '중구']
gu5 = data[(data['시도'] == '서울') & (data['시군구'].isin(gu_name))]
gu5

       발생월  발생일  시도  시군구  사고건수  사망자수  중상자수  경상자수  부상신고자수
0        1    1  서울   중구     4     0     2     5       0
9        1    1  서울  강남구     4     0     0     4       0
10       1    1  서울  강동구     2     0     1     2       0
15       1    1  서울  강북구     1     0     0     1       0
130      1    2  서울   중구     5     0     0     5       0
...    ...  ...  ..  ...   ...   ...   ...   ...     ...
57508   12   31  서울   중구     3     0     0     3       0
57517   12   31  서울  강서구     1     0     0     1       0
57522   12   31  서울  강남구    14     0     5    15       1
57523   12   31  서울  강동구     1     0     1     0       0
57530   12   31  서울  강북구     3     0     1     5       0

[1753 rows x 9 columns]

In [51]:
pd.crosstab(gu5['시군구'], columns="사고건수 합계")

col_0  사고건수 합계
시군구
강남구        365
강동구        358
강북구        334
강서구        357
중구         339

In [53]:
# 강동구 1년 중 7일만 교통사고 없었음 - 강동구 자료만 추출 
gangdong = data[(data['시도']=='서울') & (data['시군구']=='강동구')]
grp = gangdong.groupby('발생월')
grp['발생일'].size()

발생월
1     27
2     27
3     31
4     29
5     31
6     29
7     31
8     31
9     30
10    31
11    30
12    31
Name: 발생일, dtype: int64

In [54]:
# 1월에 교통사고 없는 날 4일 
gangdong[:27]

      발생월  발생일  시도  시군구  사고건수  사망자수  중상자수  경상자수  부상신고자수
10      1    1  서울  강동구     2     0     1     2       0
143     1    2  서울  강동구     3     0     1     3       0
290     1    3  서울  강동구     1     0     1     0       0
433     1    4  서울  강동구     2     0     0     2       0
586     1    5  서울  강동구     4     0     1     4       0
736     1    6  서울  강동구     3     0     0     3       0
884     1    7  서울  강동구     2     0     0     2       0
1010    1    8  서울  강동구     2     0     0     1       1
1156    1    9  서울  강동구     2     0     0     2       0
1300    1   10  서울  강동구     5     0     2     4       2
1610    1   12  서울  강동구     4     0     1     4       0
1766    1   13  서울  강동구     2     0     1     1       0
2044    1   15  서울  강동구     1     0     0     1       0
2196    1   16  서울  강동구     2     0     1     1       0
2351    1   17  서울  강동구     4     0     1     5       0
2511    1   18  서울  강동구     4     0     0     5       0
2666    1   19  서울  강동구     3     0     3     4       0
2811    1   20  서울  강동구     3     0     0     4       0
3103    1   22  서울  강동구     1     0     1     0       0
3405    1   24  서울  강동구     2     0     1     1       0
3548    1   25  서울  강동구     1     0     0     2       0
3701    1   26  서울  강동구     1     0     1     2       0
3862    1   27  서울  강동구     3     0     0     5       0
4019    1   28  서울  강동구     4     0     1     4       0
4153    1   29  서울  강동구     4     0     2     3       0
4309    1   30  서울  강동구     2     0     0     2       0
4457    1   31  서울  강동구     3     0     1     3       0

In [55]:
grp = gu5.groupby("시군구")
grp[['사고건수', '경상자수']].sum()

     사고건수  경상자수
시군구
강남구  3754  3773
강동구  1428  1480
강북구   877   846
강서구  1538  1471
중구    976   876

In [56]:
grp[['사고건수', '경상자수']].agg(['median', 'mean', 'max'])

      사고건수                  경상자수
    median       mean max median       mean max
시군구
강남구   10.0  10.284932  23   10.0  10.336986  24
강동구    4.0   3.988827  11    4.0   4.134078  18
강북구    2.0   2.625749   8    2.0   2.532934  13
강서구    4.0   4.308123  12    4.0   4.120448  15
중구     3.0   2.879056   9    2.0   2.584071  12

In [57]:
grp = data.groupby("시도")

cb = grp.get_group("충북")
cb

       발생월  발생일  시도  시군구  사고건수  사망자수  중상자수  경상자수  부상신고자수
58       1    1  충북  청주시     8     0     0    12       0
59       1    1  충북  충주시     3     0     1     3       0
60       1    1  충북  진천군     1     0     1     1       0
61       1    1  충북  증평군     1     0     0     2       0
194      1    2  충북  청주시    12     0     5     8       1
...    ...  ...  ..  ...   ...   ...   ...   ...     ...
57426   12   30  충북  단양군     2     0     1     1       0
57580   12   31  충북  청주시    19     2     2    26       1
57581   12   31  충북  충주시     2     0     0     4       0
57582   12   31  충북  제천시     3     0     1     2       0
57583   12   31  충북  진천군     2     0     1     1       0

[2284 rows x 9 columns]

In [58]:
cb2 = data[data['시도'] == '충북']
cb2.shape

(2284, 9)

In [59]:
grp = cb.groupby('시군구')
grp[['사고건수','경상자수']].sum()

     사고건수  경상자수
시군구
괴산군   140   175
단양군   134   148
보은군   136   122
영동군   149    99
옥천군   183   178
음성군   492   499
제천시   807   942
증평군   156   162
진천군   525   563
청주시  4162  4952
충주시  1105  1360

In [60]:
pd.pivot_table(data, index='시도', values='사고건수',
               aggfunc='sum', margins=True)

       사고건수
시도
강원     5930
경기    52175
경남    10703
경북    10403
광주     6908
대구    10222
대전     7490
부산    11255
서울    33465
세종     1231
울산     3576
인천     8089
전남     8213
전북     5841
제주     3963
충남     8896
충북     7989
All  196349

In [61]:
pd.pivot_table(data, index='발생월', values='사고건수',
               aggfunc='sum', margins=True)

       사고건수
발생월
1     15129
2     13836
3     15738
4     16300
5     17605
6     16690
7     16252
8     17000
9     16956
10    17720
11    17455
12    15668
All  196349

In [62]:
result =pd.pivot_table(data, index='발생월', 
            values='사고건수', aggfunc='sum')
result.sort_values(by='사고건수', ascending=False)

      사고건수
발생월
10   17720
5    17605
11   17455
8    17000
9    16956
6    16690
4    16300
7    16252
3    15738
12   15668
1    15129
2    13836

In [63]:
data['부상자수'] = data.중상자수 + data.경상자수 + data.부상신고자수
data.iloc[:,[0,1,2,3,6,7,8,9]]

       발생월  발생일  시도   시군구  중상자수  경상자수  부상신고자수  부상자수
0        1    1  서울    중구     2     5       0     7
1        1    1  서울   용산구     2     0       0     2
2        1    1  서울   성동구     0     1       0     1
3        1    1  서울  동대문구     0     1       0     1
4        1    1  서울   성북구     1     2       0     3
...    ...  ...  ..   ...   ...   ...     ...   ...
57671   12   31  대전   유성구     3     3       0     6
57672   12   31  대전   대덕구     1     6       0     7
57673   12   31  울산    중구     0     0       1     1
57674   12   31  울산    남구     3     3       0     6
57675   12   31  울산    동구     2     0       0     2

[57676 rows x 8 columns]

In [65]:
pd.pivot_table(data, index='시도', columns='발생월',
               values='사고건수', aggfunc='sum', margins=True)

발생월,1,2,3,4,5,6,7,8,9,10,11,12,All
시도,,,,,,,,,,,,,
강원,401,392,441,487,553,488,528,615,524,558,500,443,5930
경기,4244,3653,4107,4358,4618,4421,4252,4442,4407,4771,4719,4183,52175
경남,866,783,870,898,917,874,851,936,873,961,971,903,10703
경북,791,684,784,863,950,906,850,975,921,952,922,805,10403
광주,521,505,587,560,687,524,594,587,575,586,603,579,6908
대구,812,746,802,821,864,840,888,856,894,902,920,877,10222
대전,544,547,653,613,689,629,618,655,650,662,653,577,7490
부산,835,857,901,969,1006,919,961,980,1003,963,981,880,11255
서울,2588,2322,2704,2739,2920,2976,2766,2925,2839,3094,2929,2663,33465
세종,102,77,98,100,124,92,94,108,103,104,136,93,1231
울산,268,270,291,316,327,320,317,258,295,300,313,301,3576
인천,579,575,648,661,719,664,659,670,790,727,729,668,8089
전남,607,591,677,707,711,701,712,705,733,737,711,621,8213
전북,443,413,508,489,587,475,458,497,511,499,523,438,5841
제주,333,270,357,302,347,325,348,357,357,320,339,308,3963
충남,630,579,719,725,829,782,715,744,822,838,815,698,8896
충북,565,572,591,692,757,754,641,690,659,746,691,631,7989
All,15129,13836,15738,16300,17605,16690,16252,17000,16956,17720,17455,15668,196349

In [67]:
pd.pivot_table(data, index='시도', columns='발생월',
               values='부상자수', aggfunc='sum', margins=True)

발생월,1,2,3,4,5,6,7,8,9,10,11,12,All
시도,,,,,,,,,,,,,
강원,627,597,646,711,819,848,838,1007,845,880,759,669,9246
경기,6300,5510,5977,6404,6864,6465,6170,6552,6364,6922,6916,5963,76407
경남,1163,1032,1167,1220,1239,1196,1169,1406,1194,1275,1319,1177,14557
경북,1138,1004,1089,1188,1374,1232,1231,1402,1387,1325,1284,1147,14801
광주,802,767,870,847,1045,801,845,853,843,874,867,869,10283
대구,1159,1027,1106,1146,1255,1137,1232,1168,1254,1269,1251,1225,14229
대전,767,758,982,856,980,897,845,948,984,950,918,803,10688
부산,1102,1163,1200,1350,1362,1294,1268,1356,1375,1285,1252,1165,15172
서울,3473,3160,3660,3664,3859,3943,3632,3798,3693,4129,3818,3498,44327
세종,151,114,141,141,182,136,141,168,163,159,178,135,1809
울산,355,373,407,428,454,463,428,406,397,384,432,377,4904
인천,795,786,854,884,980,890,896,903,988,972,959,861,10768
전남,898,907,1047,1076,1111,1015,1036,1096,1152,1054,1115,899,12406
전북,637,617,757,678,844,666,682,756,765,724,733,628,8487
제주,486,410,509,453,513,449,517,544,513,452,474,424,5744
충남,930,843,1106,1075,1212,1069,1073,1077,1166,1209,1137,909,12806
충북,810,876,855,1017,1145,1118,977,1061,966,1120,1002,901,11848
All,21593,19944,22373,23138,25238,23619,22980,24501,24049,24983,24414,21650,278482

In [69]:
# 결측치 처리하기

In [71]:
data = pd.read_excel("K팀 대학 생활 만족도 설문(응답).xlsx")
data

,id,Q1,Q2,Q3,Q4,Q5,Q6,Q7,Q8,Q9,Q10
0,1,남자,3학년,인사대,6,그렇다,보통,불만족,만족,3,학생회
1,2,여자,1학년,디자인대,6,그렇다,만족,만족,보통,3,아직은 모르겠다.
2,3,여자,1학년,과기대,6,그렇다,보통,보통,보통,4,모람제
3,4,여자,1학년,인사대,5,보통,만족,매우 불만족,보통,3,아직 없는듯
4,5,남자,1학년,과기대,6,그렇다,매우 불만족,매우 만족,만족,4,"동아리,소모임"
5,6,여자,1학년,디자인대,6,그렇다,만족,보통,만족,4,개강총회
6,7,여자,1학년,디자인대,6,그렇다,매우 만족,보통,보통,3,아직...없다
7,8,남자,1학년,인사대,6,그렇다,만족,만족,매우 만족,4,OT
8,9,남자,1학년,디자인대,6,매우 그렇다,매우 만족,매우 만족,매우 만족,5,술
9,10,남자,1학년,과기대,6,NaN,만족,매우 만족,매우 만족,5,아직 많은 활동을 하지않음.
10,11,여자,1학년,과기대,6,그렇다,불만족,만족,보통,9,없다.
11,12,여자,2학년,딘자인대,6,그렇다,불만족,불만족,보통,3,전공수업
12,13,여자,2학년,디자인대,7,그렇다,보통,불만족,보통,3,헬퍼
13,14,여자,1학년,인사대,999,보통,NaN,만족,만족,3,없다
14,15,여자,1학년,과기대,999,그렇다,불만족,보통,만족,4,모람제 푸드트럭
15,16,여자,1학년,인사대,999,보통,매우 만족,만족,보통,9,술
16,17,여자,1학년,과기대,6,그렇다,NaN,보통,보통,3,아직없당
17,18,남자,1학년,과기대,5,매우 그렇다,만족,매우 만족,매우 만족,5,기숙사 형들과 재밌게 노는 일
18,19,여자,3학년,디자인대,8,그렇다,불만족,보통,보통,3,전공
19,20,여자,1학년,과기대,6,보통,만족,만족,매우 만족,3,학생회
20,21,남자,1학년,디자인대,6,그렇다,불만족,만족,만족,4,.
21,22,남자,1학년,과기대,6,그렇다,만족,보통,보통,3,OT
22,23,여자,1학년,과기대,6,매우 그렇다,보통,만족,만족,5,OT
23,24,여자,2학년,디자인대,6,그렇지 않다,매우 불만족,보통,보통,3,체육대회
24,25,여자,1학년,과기대,6,그렇다,매우 만족,만족,보통,4,아직 없다
25,26,남자,1학년,과기대,6,보통,만족,보통,불만족,3,과제
26,27,여자,1학년,과기대,6,그렇다,만족,만족,만족,4,MT (마시고 토하고)
27,28,남자,1학년,과기대,8,그렇다,불만족,만족,매우 불만족,3,OT
28,29,여자,1학년,과기대,6,그렇다,만족,만족,만족,3,오티
29,30,여자,3학년,인사대,7,보통,매우 불만족,보통,매우 불만족,1,단기연수
30,31,남자,1학년,과기대,6,매우 그렇다,만족,만족,보통,4,없음
31,32,여자,1학년,과기대,6,그렇다,보통,보통,만족,4,기리보이
32,33,남자,1학년,과기대,6,매우 그렇다,매우 불만족,매우 만족,보통,4,개강총회
33,34,여자,1학년,과기대,6,그렇다,불만족,만족,만족,4,오티
34,35,여자,3학년,인사대,8,그렇다,매우 불만족,매우 불만족,매우 불만족,3,아직없음
35,36,남자,1학년,과기대,5,그렇다,보통,보통,보통,3,푸드트럭
36,37,남자,1학년,과기대,7,그렇다,보통,만족,만족,4,학과 친구들과 운동하는 것
37,38,여자,1학년,인사대,5,보통,매우 만족,만족,보통,3,아직없다
38,39,여자,1학년,과기대,6,그렇다,불만족,만족,보통,4,ot
39,40,여자,1학년,과기대,6,그렇다,만족,만족,만족,3,오티
40,41,여자,3학년,인사대,6,그렇다,불만족,만족,만족,3,학생회

In [73]:
data.isna().sum()

id     0
Q1     0
Q2     0
Q3     0
Q4     0
Q5     1
Q6     2
Q7     0
Q8     0
Q9     0
Q10    0
dtype: int64

In [74]:
idx1 = data[data.Q4 == 999].index
idx1

Index([13, 14, 15], dtype='int64')

In [75]:
idx2 = data[data.Q9 == 9].index
idx2

Index([10, 15], dtype='int64')

In [76]:
data.loc[idx1, 'Q4'] = None
data.loc[idx2, 'Q9'] = None

data.isna().sum()

id     0
Q1     0
Q2     0
Q3     0
Q4     3
Q5     1
Q6     2
Q7     0
Q8     0
Q9     2
Q10    0
dtype: int64

In [78]:
data

,id,Q1,Q2,Q3,Q4,Q5,Q6,Q7,Q8,Q9,Q10
0,1,남자,3학년,인사대,6.0,그렇다,보통,불만족,만족,3.0,학생회
1,2,여자,1학년,디자인대,6.0,그렇다,만족,만족,보통,3.0,아직은 모르겠다.
2,3,여자,1학년,과기대,6.0,그렇다,보통,보통,보통,4.0,모람제
3,4,여자,1학년,인사대,5.0,보통,만족,매우 불만족,보통,3.0,아직 없는듯
4,5,남자,1학년,과기대,6.0,그렇다,매우 불만족,매우 만족,만족,4.0,"동아리,소모임"
5,6,여자,1학년,디자인대,6.0,그렇다,만족,보통,만족,4.0,개강총회
6,7,여자,1학년,디자인대,6.0,그렇다,매우 만족,보통,보통,3.0,아직...없다
7,8,남자,1학년,인사대,6.0,그렇다,만족,만족,매우 만족,4.0,OT
8,9,남자,1학년,디자인대,6.0,매우 그렇다,매우 만족,매우 만족,매우 만족,5.0,술
9,10,남자,1학년,과기대,6.0,NaN,만족,매우 만족,매우 만족,5.0,아직 많은 활동을 하지않음.
10,11,여자,1학년,과기대,6.0,그렇다,불만족,만족,보통,NaN,없다.
11,12,여자,2학년,딘자인대,6.0,그렇다,불만족,불만족,보통,3.0,전공수업
12,13,여자,2학년,디자인대,7.0,그렇다,보통,불만족,보통,3.0,헬퍼
13,14,여자,1학년,인사대,NaN,보통,NaN,만족,만족,3.0,없다
14,15,여자,1학년,과기대,NaN,그렇다,불만족,보통,만족,4.0,모람제 푸드트럭
15,16,여자,1학년,인사대,NaN,보통,매우 만족,만족,보통,NaN,술
16,17,여자,1학년,과기대,6.0,그렇다,NaN,보통,보통,3.0,아직없당
17,18,남자,1학년,과기대,5.0,매우 그렇다,만족,매우 만족,매우 만족,5.0,기숙사 형들과 재밌게 노는 일
18,19,여자,3학년,디자인대,8.0,그렇다,불만족,보통,보통,3.0,전공
19,20,여자,1학년,과기대,6.0,보통,만족,만족,매우 만족,3.0,학생회
20,21,남자,1학년,디자인대,6.0,그렇다,불만족,만족,만족,4.0,.
21,22,남자,1학년,과기대,6.0,그렇다,만족,보통,보통,3.0,OT
22,23,여자,1학년,과기대,6.0,매우 그렇다,보통,만족,만족,5.0,OT
23,24,여자,2학년,디자인대,6.0,그렇지 않다,매우 불만족,보통,보통,3.0,체육대회
24,25,여자,1학년,과기대,6.0,그렇다,매우 만족,만족,보통,4.0,아직 없다
25,26,남자,1학년,과기대,6.0,보통,만족,보통,불만족,3.0,과제
26,27,여자,1학년,과기대,6.0,그렇다,만족,만족,만족,4.0,MT (마시고 토하고)
27,28,남자,1학년,과기대,8.0,그렇다,불만족,만족,매우 불만족,3.0,OT
28,29,여자,1학년,과기대,6.0,그렇다,만족,만족,만족,3.0,오티
29,30,여자,3학년,인사대,7.0,보통,매우 불만족,보통,매우 불만족,1.0,단기연수
30,31,남자,1학년,과기대,6.0,매우 그렇다,만족,만족,보통,4.0,없음
31,32,여자,1학년,과기대,6.0,그렇다,보통,보통,만족,4.0,기리보이
32,33,남자,1학년,과기대,6.0,매우 그렇다,매우 불만족,매우 만족,보통,4.0,개강총회
33,34,여자,1학년,과기대,6.0,그렇다,불만족,만족,만족,4.0,오티
34,35,여자,3학년,인사대,8.0,그렇다,매우 불만족,매우 불만족,매우 불만족,3.0,아직없음
35,36,남자,1학년,과기대,5.0,그렇다,보통,보통,보통,3.0,푸드트럭
36,37,남자,1학년,과기대,7.0,그렇다,보통,만족,만족,4.0,학과 친구들과 운동하는 것
37,38,여자,1학년,인사대,5.0,보통,매우 만족,만족,보통,3.0,아직없다
38,39,여자,1학년,과기대,6.0,그렇다,불만족,만족,보통,4.0,ot
39,40,여자,1학년,과기대,6.0,그렇다,만족,만족,만족,3.0,오티
40,41,여자,3학년,인사대,6.0,그렇다,불만족,만족,만족,3.0,학생회

In [79]:
pd.crosstab(data['Q9'], columns='빈도', margins=True)

col_0  빈도  All
Q9
1.0     1    1
3.0    20   20
4.0    14   14
5.0     4    4
All    39   39

In [80]:
pd.crosstab(data['Q4'], columns='빈도', margins=True, dropna=False)

col_0  빈도   All
Q4
5.0     4   4.0
6.0    28  28.0
7.0     3   3.0
8.0     3   3.0
NaN     3   NaN
All    41  41.0